introduce_text = """
Це аналітична панель, розроблена спеціально для компанії [Gravity Smart Home](https://gravity.com.ua/). Вона дозволяє в режимі реального часу аналізувати зміни у воронках в [KeyCRM](https://keycrm.app/) через [API](https://docs.keycrm.app/#/): визначати нові та попередні картки, фіксувати дії менеджерів, класифікувати ліди за прогрітими, кваліфікованими, навчанням, зустрічами тощо. Порівнюючи поточні дані з попереднім станом, панель надає повну картину динаміки роботи відділу продажів.
"""

how_to_use_text = """
**1.** Щодня система автоматично зберігає базовий стан карток у воронках з [KeyCRM](https://keycrm.app/).  
**2.** Якщо ви хочете оновити цей базовий стан вручну — натисніть 💾 **Зберегти стан**.  
**3.** Щоб побачити оновлення та зміни — натисніть 🔎 **Переглянути аналітику**.  
**4.** У таблицях нижче ви побачите підсумкову роботу менеджерів за сьогодні.
"""

how_to_work_text = """
Аналітична система класифікує картки на категорії за типом воронки (Не Алмази, Алмази, Діаманти) та їх поведінкою впродовж дня. Нижче наведено основну логіку:

### 🔹 Не Алмази
- **Нові:** якщо сьогодні з’явився менеджер та був дзвінок, або суміжні були перенесені в цю воронку.
- **Попередні:** якщо менеджер вже був, і сьогодні був дзвінок.

### 🔹 Алмази / Діаманти
- **Нові:** всі, хто сьогодні був перенесений у відповідну воронку.
- **Попередні:** всі, хто вже перебував у воронці, і сьогодні до них подзвонили.

### 🔸 Класифікація станів
- **Прогріті:** має статус “Прогрітий” у воронці або кастомне поле `ПРОГРІТИЙ (готовий працювати)`.
- **Не прогріті:** не відповідають критеріям “Прогрітий”.
- **Не кваліфіковані:** має статус із групи “не кваліфікований”.
- **Рефералка:** резервна категорія (поки не використовується).
- **Навчання:** заповнене кастомне поле `Закр. Навчання В ЗАПИСІ`.
- **Зустріч:** заповнене поле `Закр. Зустріч ONLINE` або `Закр. Зустріч КИЇВ`.
- **Планування:** статус `План: НАДІСЛАВ`.

Ця класифікація допомагає швидко побачити стан кожного ліда у контексті щоденної динаміки роботи менеджерів.
"""